InformationRegisters/ТелеграмСобеседники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСобеседники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикПринятыхСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>first_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>last_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>username</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПозволятьОбщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЧата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмСобеседники/Ext/ManagerModule.bsl
Процедура ЗапомнитьСобеседника(Сообщение, ДанныеБота, ПозволитьДальнейшееОбщение) Экспорт
	
	Чат 				= Сообщение.chat;
	КоллекцияСвойств 	= Чат.Свойства();
	
	МЗ = РегистрыСведений.ТелеграмСобеседники.СоздатьМенеджерЗаписи();
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		СчетчикПринятыхСообщений = МЗ.СчетчикПринятыхСообщений + 1;
		ПозволятьОбщение = МЗ.ПозволятьОбщение;
	Иначе
		СчетчикПринятыхСообщений = 1;
		ПозволятьОбщение = Ложь; 
	КонецЕсли;
	
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	
	Если ДанныеБота.Свойство("Пользователь") Тогда
		МЗ.Пользователь = ДанныеБота.Пользователь;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("first_name") <> Неопределено Тогда
		МЗ.first_name = Чат.first_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("last_name") <> Неопределено Тогда
		МЗ.last_name = Чат.last_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("username") <> Неопределено Тогда
		МЗ.username = Чат.username;
	КонецЕсли;
	
	МЗ.Дата = ТекущаяДата();
	МЗ.СчетчикПринятыхСообщений = СчетчикПринятыхСообщений;
	МЗ.ПозволятьОбщение = ПозволятьОбщение;
	МЗ.Записать();
	
	ПозволитьДальнейшееОбщение = ПозволятьОбщение;
	//{ DIRachkovsky@1cbit.ru
	ДанныеБота.Вставить("Пользователь", МЗ.Пользователь);
	//}
	
КонецПроцедуры
